{
  "timestamp": "2025-03-10T10:29:03.476715+05:30",
  "region": "Tamil Nadu",
  "categories": {
    "Politics": {
      "news_items": [
        {
          "date": "2025-03-10",
          "content": "Here's a summary of the latest political news and developments in Tamil Nadu as of March 10, 2025:"
        },
        {
          "date": "2025-03-10",
          "content": "*   **Delimitation Issue:** The ruling DMK is actively opposing the proposed delimitation exercise, viewing it as a threat to Tamil Nadu's representation in Parliament."
        },
        {
          "date": "2025-03-10",
          "content": "*   Chief Minister M.K. Stalin has called for a united political front against the delimitation."
        },
        {
          "date": "2025-03-10",
          "content": "*   The DMK has resolved to raise the issue in Parliament and is coordinating with other parties to garner support."
        },
        {
          "date": "2025-03-10",
          "content": "*   The DMK is sending senior ministers and MPs to seven states to rally support from political parties."
        },
        {
          "date": "2025-03-10",
          "content": "*   Stalin has criticized the Union government, stating that states that have effectively implemented family planning measures should not be penalized."
        },
        {
          "date": "2025-03-10",
          "content": "*   He has also appealed to parties to set aside political differences and attend meetings regarding the delimitation issue."
        },
        {
          "date": "2025-03-10",
          "content": "*   An all-party meeting in Tamil Nadu has favored retaining the existing number of Lok Sabha seats until 2056."
        },
        {
          "date": "2025-03-10",
          "content": "*   **BJP's Stance:** The BJP is facing increasing isolation in Tamil Nadu due to its stance on language and delimitation, which is at odds with the state's political mainstream."
        },
        {
          "date": "2025-03-10",
          "content": "*   **AIADMK's Position:** The AIADMK is participating in meetings regarding delimitation, despite usually not attending all-party meetings convened by the DMK."
        },
        {
          "date": "2025-03-10",
          "content": "*   **New Political Considerations:** There are fresh political considerations and coalition strategies being examined, with the core objective of stunning the DMK."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Other Political Activity:**"
        },
        {
          "date": "2025-03-10",
          "content": "*   Amit Shah has urged CM Stalin to implement engineering and medical education in Tamil."
        }
      ],
      "total_items": 13
    },
    "Economy": {
      "news_items": [
        {
          "date": "2025-03-10",
          "content": "As of March 10, 2025, here's a summary of the latest news and developments regarding the Tamil Nadu economy:"
        },
        {
          "date": "2025-03-10",
          "content": "**Economic Overview:**"
        },
        {
          "date": "2025-03-10",
          "content": "*   **GSDP:** Tamil Nadu has the second largest economy in India. The state's nominal GDP is estimated to be US$412 billion in 2025, and US$1.64 trillion in PPP terms."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Growth:** Tamil Nadu's economy is expected to grow at around 6% in 2025, which is slightly below the national average, but still reflects strong development. A study suggests that Tamil Nadu's economy may grow at a rate of 8.08% to 10.69% in 2024-25."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Economic Survey:** The Tamil Nadu government may launch its first Economic Survey on March 14, coinciding with the tabling of the State Budget."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Key Sectors:** The services sector contributes 54% to the state's GDP, followed by manufacturing at 33% and agriculture at 13%."
        },
        {
          "date": "2025-03-10",
          "content": "*   **GSDP Growth by Sector (2023-24):** Services are estimated to grow by 9.4%, manufacturing by 7.1%, and agriculture by 4.3%."
        },
        {
          "date": "2025-03-10",
          "content": "**Fiscal Situation:**"
        },
        {
          "date": "2025-03-10",
          "content": "*   **GSDP:** Tamil Nadu's GSDP for 2024-25 is projected to be Rs 31,55,096 crore, a 16% increase over 2023-24."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Expenditure:** Expenditure for 2024-25 is estimated at Rs 4,12,504 crore, a 12% increase over the revised estimates of 2023-24."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Receipts:** Receipts for 2024-25 are estimated to be Rs 3,03,814 crore, a 10% increase compared to the revised estimate of 2023-24."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Revenue Deficit:** The revenue deficit in 2024-25 is estimated to be 1.6% of GSDP (Rs 49,279 crore), similar to the revised estimates for 2023-24."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Fiscal Deficit:** The fiscal deficit for 2024-25 is targeted at 3.4% of GSDP (Rs 1,08,690 crore), marginally lower than the revised estimates for 2023-24."
        },
        {
          "date": "2025-03-10",
          "content": "**Other Key Points:**"
        },
        {
          "date": "2025-03-10",
          "content": "*   **Infrastructure:** Infrastructure is considered crucial for achieving Tamil Nadu's vision of becoming a $1 trillion economy by 2030."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Manufacturing:** The manufacturing sector remains resilient, with capacity utilization exceeding long-term averages, and private sector investments continue to expand steadily."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Global Factors:** Tamil Nadu's growth is susceptible to global fluctuations."
        }
      ],
      "total_items": 17
    },
    "Sports": {
      "news_items": [
        {
          "date": "2025-03-10",
          "content": "Here's a summary of the latest sports news and developments in Tamil Nadu as of March 10, 2025:"
        },
        {
          "date": "2025-03-10",
          "content": "**Major Events & Achievements:**"
        },
        {
          "date": "2025-03-10",
          "content": "*   **India Wins Champions Trophy 2025:** India won the Champions Trophy, defeating New Zealand in the final. Rohit Sharma was named Player of the Match."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Tamil Nadu as a Sports Hub:** Tamil Nadu is increasingly recognized as a sports capital in the Indian subcontinent, thanks to government initiatives."
        },
        {
          "date": "2025-03-10",
          "content": "**Infrastructure Development:**"
        },
        {
          "date": "2025-03-10",
          "content": "*   **Mini Stadiums:** 19 constituencies in Tamil Nadu will soon have mini stadiums, each worth ₹3 crore. Construction is set to begin soon, with facilities for various sports like football, volleyball, basketball, and kabaddi, as well as a gym and running track. Tambaram is among the locations getting a new mini stadium in the Irumbuliyur area."
        },
        {
          "date": "2025-03-10",
          "content": "**Other News:**"
        },
        {
          "date": "2025-03-10",
          "content": "*   **Boxing Arena and Academy:** Chennai has a new boxing arena and academy."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Kabaddi:** Kabaddi is a popular sport in the Tambaram and Pallavaram regions, which have produced national-level players."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Traditional Sports:** Traditional sports like Silambam, Kabaddi, and Seval Sandai are popular in Tamil Nadu."
        }
      ],
      "total_items": 10
    },
    "Science_Technology": {
      "news_items": [
        {
          "date": "2025-03-10",
          "content": "As of March 10, 2025, here's a summary of the latest science and technology news and developments in Tamil Nadu:"
        },
        {
          "date": "2025-03-10",
          "content": "*   **Weather Forecast:** A cyclonic circulation is expected to bring widespread rain to Tamil Nadu from March 10th to 13th, with heavy intensity in the southern districts on March 11th. The Regional Meteorological Centre in Chennai has warned of heavy rainfall in Kanyakumari, Tirunelveli, Tenkasi, Thoothukudi, Virudhunagar and Ramanathapuram. Schools and colleges in these six districts are likely to be closed on March 10th. Fishermen are advised not to venture into the sea due to expected wind speeds of up to 45 kmph along the southern coast. The rest of the state, including Chennai, is experiencing intense summer heat, with a potential temperature increase of two to three degrees Celsius."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Tamil Nadu Artificial Intelligence Mission:** The Tamil Nadu Artificial Intelligence Mission (TNAIM) will primarily focus on research and developing AI-driven solutions for governance."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Focus Beyond Chennai:** Tamil Nadu is actively working to catalyze economic development across the state and narrow the digital divide by establishing IT office spaces and fibernet infrastructure in remote areas."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Quantum Computing:** Tamil Nadu is procuring a quantum computer from Finland to boost research and innovation in quantum computing under the National Quantum Mission."
        },
        {
          "date": "2025-03-10",
          "content": "*   **E-Governance:** The state is enhancing e-governance by modernizing government offices and increasing the accessibility of online government services. There is also an ongoing upgradation of the State Data Centre with cloud computing infrastructure and disaster data recovery facilities."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Fibernet Project:** A fibernet project aims to connect 12,525 villages and 380 blocks, building digital public infrastructure to ensure reliable high-speed internet access, even in rural areas."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Electric Vehicle Manufacturing:** Hyundai Motor India's first rollout from its new plant is likely to be an electric SUV in 2025."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Collaboration with CSIR-NIIST:** The Tamil Nadu Government is looking to collaborate with CSIR-National Institute for Interdisciplinary Science and Technology (CSIR-NIIST) to leverage their technologies and solutions for agriculture, industrial, and MSME sectors."
        },
        {
          "date": "2025-03-10",
          "content": "*   **IInvenTiv-2025:** India's young minds are showcasing future tech at IIT Madras."
        }
      ],
      "total_items": 10
    },
    "Environment": {
      "news_items": [
        {
          "date": "2025-03-10",
          "content": "As of March 10, 2025, here's a summary of the latest environmental news and developments in Tamil Nadu:"
        },
        {
          "date": "2025-03-10",
          "content": "**Climate Change Initiatives and Policies:**"
        },
        {
          "date": "2025-03-10",
          "content": "*   **Climate Change Policy for Education:** The Tamil Nadu government is introducing a climate change policy specifically for educational purposes and establishing ecology clubs in all schools across the state. This initiative aims to raise climate awareness among students and encourage their active participation in environmental conservation."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Tamil Nadu Climate Change Mission:** Tamil Nadu aims to achieve carbon neutrality well ahead of the national target of 2070. The Tamil Nadu Climate Change Mission is implementing strategies and policies to maximize the co-benefits between mitigation, adaptation, and sustainable development."
        },
        {
          "date": "2025-03-10",
          "content": "*   **One Health and Climate Hub:** The state government is setting up a 'One Health and Climate Hub' to address the interconnected challenges of human, animal, and environmental health in the face of climate change. This hub will conduct studies to map health risks and diseases exacerbated by climate change and develop predictive models using AI."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Climate Smart Villages:** The government has selected ten villages to be transformed into Climate-Smart Villages. These villages will implement sustainable agricultural practices, improve water management systems, and provide climate-smart practices training to local communities."
        },
        {
          "date": "2025-03-10",
          "content": "**Environmental Issues and Concerns:**"
        },
        {
          "date": "2025-03-10",
          "content": "*   **Rising Temperatures and Health Risks:** Tamil Nadu faces challenges such as rising temperatures, zoonotic outbreaks, vector-borne diseases, coastal vulnerabilities, and biodiversity loss."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Groundwater Contamination:** A government survey reveals that nearly a fifth of collected samples exceed permissible pollutant limits, highlighting groundwater contamination across India, including Tamil Nadu."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Coastal Project Issues:** An audit report flags issues with coastal projects in Tamil Nadu."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Environmental Degradation:** There are concerns about the slow but steady erosion of the natural environment, destruction of water bodies, and decline in forest cover, which have disabled the potential resistance against climate challenges."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Industrial Pollution:** Concerns exist regarding industrial pollution of the Cauvery river and sand quarrying in various districts."
        },
        {
          "date": "2025-03-10",
          "content": "**Other Developments:**"
        },
        {
          "date": "2025-03-10",
          "content": "*   **Green Initiatives:** The state has launched initiatives like the Green Tamil Nadu Mission and the Tamil Nadu Wetland Mission, focusing on afforestation and wetland development."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Waste Management:** Comprehensive waste management and recycling programs are underway to minimize the environmental impact of waste disposal."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Sustainable Practices:** The government is promoting energy-efficient buildings and providing incentives for sustainable practices."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Environmental Awards:** The Chief Minister presented environmental awards to individuals and organizations for their contributions to environmental protection and education."
        }
      ],
      "total_items": 17
    },
    "Education": {
      "news_items": [
        {
          "date": "2025-03-10",
          "content": "As of March 10, 2025, here's a summary of the latest education news and developments in Tamil Nadu:"
        },
        {
          "date": "2025-03-10",
          "content": "*   **State Education Policy (SEP) vs. National Education Policy (NEP):** Tamil Nadu's SEP is designed to be student-friendly and diverges from the NEP. Key features include play-based pre-primary schools, open-book assessments, and no common exams until Class X. The entry age for Class 1 is set at 5 years. Admissions to undergraduate programs will be based on Class XI and XII marks, not entrance exams. The policy supports a two-language formula and discourages the establishment of foreign universities but supports tie-ups with them. It also suggests banning all coaching centers, including private tuition centers."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Infrastructure Development:** The Tamil Nadu government is investing in improving infrastructure facilities in government schools through schemes like the Perasiriyar Anbazhagan School Development Scheme. Hi-tech labs are being established in government schools to expand digital technology."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Curriculum and Pedagogy:** The government is implementing schemes to ensure quality education and holistic personality development, aligning with the Tamil Nadu State Curriculum Framework. This includes activity-based classroom transactions, leadership training for headmasters, and capacity building for teachers."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Focus on Inclusivity:** Tamil Nadu has increased enrollment of women in higher education and created programs for inclusive education, especially for students with disabilities."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Translation Initiative:** Tamil Nadu is translating medical and academic textbooks to bridge language barriers for students."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Historical Context:** Tamil Nadu has a rich educational history, from ancient learning systems to the introduction of Western-style education during colonial rule and the expansion of higher education post-independence."
        }
      ],
      "total_items": 7
    },
    "Culture": {
      "news_items": [
        {
          "date": "2025-03-10",
          "content": "As of March 10, 2025, here's a summary of the latest cultural news and developments in Tamil Nadu:"
        },
        {
          "date": "2025-03-10",
          "content": "**Events and Festivals:**"
        },
        {
          "date": "2025-03-10",
          "content": "*   **Controversial Protest:** A Dravidian outfit called Dravidar Thalam (DT) is planning a protest in Tiruppur on March 10, 2025, advocating for the abolishment of household kitchens. This is part of a broader campaign against traditional family systems and societal norms."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Temple Festivals:** Sri Koniamman temple's car festival was celebrated on March 1st. Panguni Uthiram is celebrated in Perur Patteswarar temple in March. Also, the Car Festival in Aranganathar Temple, Karamadai, is celebrated in March."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Annual Events:** Several festivals are celebrated annually in Tamil Nadu, including Pongal (January 15), Thaipusam and Thirukarthigai in Maruthamalai Temple (January/February)."
        },
        {
          "date": "2025-03-10",
          "content": "**Cultural Preservation and Development:**"
        },
        {
          "date": "2025-03-10",
          "content": "*   **Government Initiatives:** The Department of Tamil Development - Culture was established in 1984 to preserve and promote Tamil arts, crafts, and culture."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Endangered Species Conservation:** The Tamil Nadu government has established a ₹50 crore fund to protect endangered species, which includes exploring cultural preservation through Sacred Groves."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Temple Restoration:** The government is allocating significant funds for the restoration of temples and temple tanks, recognizing them as symbols of historical legacy and cultural pride."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Rural Arts Development:** The Tamil Nadu Rural Arts Development Centre in Madurai promotes and develops rural folk arts."
        },
        {
          "date": "2025-03-10",
          "content": "**Other Developments:**"
        },
        {
          "date": "2025-03-10",
          "content": "*   **Language:** There's ongoing discussion regarding the three-language formula in India and its relevance to Tamil Nadu, with some suggesting the inclusion of a fourth, foreign language in the curriculum."
        },
        {
          "date": "2025-03-10",
          "content": "Please note that while I've provided a summary of recent news, cultural events are constantly evolving. For the most up-to-the-minute information, checking local news sources closer to the date is always a good idea."
        }
      ],
      "total_items": 13
    },
    "Health": {
      "news_items": [
        {
          "date": "2025-03-10",
          "content": "As of March 10, 2025, here's a summary of the latest health news and developments in Tamil Nadu:"
        },
        {
          "date": "2025-03-10",
          "content": "*   **International Conference:** An International Conference on Medical Health Science, Pharmacology & Bio Technology is being held in Salem, Tamil Nadu on March 10, 2025."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Women's Health Initiative:** Star Health launched 'SheTARA,' a women's health initiative providing free medical screenings across more than 40 locations in Tamil Nadu. This coincided with International Women's Day."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Organ Donation:** Tamil Nadu saw an 18% surge in organ donations in 2024."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Doctor Transfers and Recruitment:** The Tamil Nadu government was set to distribute transfer orders to over 1,000 doctors on February 20, 2025. Additionally, appointment orders for 2,642 newly recruited doctors were to be issued within the following 10 days."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Student Health Advice:** Ahead of public examinations, Tamil Nadu Chief Minister M.K. Stalin advised students to prioritize their health, including sleep, food habits, and mental well-being."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Dengue Surge:** Tamil Nadu is battling a dengue surge, with 11,743 cases and four deaths reported. Chennai, Coimbatore, and Krishnagiri are among the most affected districts."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Mental Health Program:** The National Health Mission's district mental health program aims to improve accessibility to mental health treatment, but faces challenges with limited workforce."
        }
      ],
      "total_items": 8
    },
    "Infrastructure": {
      "news_items": [
        {
          "date": "2025-03-10",
          "content": "Here's a summary of the latest infrastructure news and developments in Tamil Nadu as of March 10, 2025:"
        },
        {
          "date": "2025-03-10",
          "content": "**Transport:**"
        },
        {
          "date": "2025-03-10",
          "content": "*   **Coimbatore Metro:** Land acquisition for the Coimbatore Metro project is set to begin in March 2025, focusing on Avinashi Road and Coimbatore-Sathyamangalam Road. The project aims to be completed within three years. The first phase includes two corridors: Ukkadam bus stand to Neelambur (20.4 km) and Coimbatore Railway Junction to Valiyampalayam Pirivu (14.4 km). The metro trains will have three coaches, each carrying over 700 passengers."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Railway Budget:** Tamil Nadu's railway budget for 2025-26 is ₹6,626 crore. Funds will be used to speed up ongoing infrastructure projects and explore new initiatives, including introducing Vande Metro services in Chennai."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Vande Metro:** Chennai-Jolarpet, Chennai-Gudur, and Chennai-Villupuram routes have been shortlisted for Chennai's first Vande Metro."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Railway Station Upgrades:** ₹2,948 crore has been allocated for upgrading 77 railway stations under the Amrit Bharat Station Scheme. Chennai Egmore, Madurai, Rameswaram, Katpadi, and Kanyakumari are among the stations being redeveloped, with a combined budget of ₹1,896 crore."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Road Expansion:** RPP Infra Projects secured a ₹62.78 crore contract to widen the Avinashi-Mettupalayam Road (SH-80) from two lanes to four lanes, including culvert reconstruction and drainage work in Tirupur."
        },
        {
          "date": "2025-03-10",
          "content": "**Water Supply:**"
        },
        {
          "date": "2025-03-10",
          "content": "*   **Chennai Water Supply Project:** RPP Infra Projects won a contract worth Rs 809.3 million for a water supply project under the Vada Chennai Valarchi Thittam (North Chennai Development Scheme) in Tamil Nadu. The project includes constructing underground water tanks, water distribution stations, laying feeder mains, replacing PVC water mains, and strengthening water infrastructure across multiple depots in areas IV and V."
        },
        {
          "date": "2025-03-10",
          "content": "**Industrial Development:**"
        },
        {
          "date": "2025-03-10",
          "content": "*   **New SIPCOT Industrial Park:** The Government of Tamil Nadu plans to establish a new SIPCOT Industrial Park in Nagapattinam, spanning 450 acres. The project, estimated at Rs. 2,500 million, aims to promote industrial growth in the region. Pre-project activities are in progress as of March 2025."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Manufacturing Expansion:** A manufacturing expansion project is planned in Hosur, Krishnagiri, focusing on fuel and electric powered two-wheelers and three-wheelers with an investment of Rs. 44,424.1 million. Construction is set to begin in July 2025 and complete by March 2029. It is currently awaiting environmental clearance."
        },
        {
          "date": "2025-03-10",
          "content": "**Other Developments:**"
        },
        {
          "date": "2025-03-10",
          "content": "*   **Green Shield Project:** A proposal for a green shield project in Thoothukudi district has been submitted to the Union Ministry with an outlay of ₹27.53 crore. The project aims to halt sea erosion through nature-based solutions."
        },
        {
          "date": "2025-03-10",
          "content": "*   **SEAC Panel:** The Tamil Nadu government intends to set up an additional State Expert Appraisal Committee (SEAC) to expedite clearances for infrastructure and development projects."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Public-Private Partnerships:** Tamil Nadu is embracing public-private partnerships (PPP) for infrastructure projects, including a new airport in Parandur, energy advancements, waste-to-energy projects, and urban infrastructure improvements."
        }
      ],
      "total_items": 16
    },
    "International_Relations": {
      "news_items": [
        {
          "date": "2025-03-10",
          "content": "Here's a summary of the latest news and developments in Tamil Nadu's international relations on March 10, 2025:"
        },
        {
          "date": "2025-03-10",
          "content": "*   **Delimitation Issue:** DMK MPs are set to strongly oppose the proposed population-based delimitation of Lok Sabha seats in the upcoming Parliament session. They fear that Tamil Nadu and other Southern states will lose seats due to this exercise and are seeking support from other affected states like Odisha and West Bengal. DMK is insisting that delimitation be based on the 1971 census to avoid a reduction in Tamil Nadu's representation."
        },
        {
          "date": "2025-03-10",
          "content": "*   **FTA Talks with EU:** India and the European Union are scheduled to begin the tenth round of talks for a proposed free trade agreement in Brussels."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Fishermen Arrests by Sri Lankan Navy:** In response to repeated arrests of Tamil Nadu fishermen by the Sri Lankan Navy, the Union Minister of State for Parliamentary Affairs L Murugan stated that the external affairs ministry is acting quickly to rescue the arrested fishermen."
        },
        {
          "date": "2025-03-10",
          "content": "*   **Anna University International Relations:** Anna University has several international partnerships for academic and research engagement. They are planning international activities for students, including an Immersion Program at Aalto, Finland."
        }
      ],
      "total_items": 5
    }
  }
}